# Укажите базовый образ с Node.js
FROM node:16-alpine

# Создайте директорию приложения
WORKDIR /usr/src/app

# Копируйте package.json и package-lock.json (если есть)
COPY package*.json ./

# Установите зависимости приложения
RUN npm ci

# Если вы хотите установить только зависимости для production, используйте команду ниже:
# RUN npm ci --only=production

# Копируйте исходный код приложения
COPY . .

# Укажите порт, который будет использоваться вашим приложением
# (если ваш бот работает с вебхуками и использует порт для прослушивания)
EXPOSE 3000

# Запустите приложение
CMD [ "npm", "start" ]
